# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [30]:
import numpy as np 
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [31]:
df1 = pd.DataFrame(np.random.randint(1,4,size=(100)))
df1

    0
0   2
1   1
2   2
3   1
4   3
.. ..
95  1
96  1
97  1
98  3
99  1

[100 rows x 1 columns]

In [32]:
df2 = pd.DataFrame(np.random.randint(1,3,size=(100)))
df2

    0
0   2
1   1
2   1
3   1
4   1
.. ..
95  1
96  2
97  1
98  2
99  2

[100 rows x 1 columns]

In [33]:
df3 = pd.DataFrame(np.random.randint(10000,30000,size=(100)))
df3

        0
0   12619
1   11899
2   27310
3   17872
4   17888
..    ...
95  13472
96  26370
97  21955
98  10211
99  25690

[100 rows x 1 columns]

### Step 3. Let's create a DataFrame by joinning the Series by column

In [34]:
dfj= pd.concat([df1, df2,df3],axis=1)
dfj

    0  0      0
0   2  2  12619
1   1  1  11899
2   2  1  27310
3   1  1  17872
4   3  1  17888
.. .. ..    ...
95  1  1  13472
96  1  2  26370
97  1  1  21955
98  3  2  10211
99  1  2  25690

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [35]:
dfj= dfj.rename(columns = {0:'berds',1:'bathrs',2:'price_sqr_meter'})
dfj

    berds  berds  berds
0       2      2  12619
1       1      1  11899
2       2      1  27310
3       1      1  17872
4       3      1  17888
..    ...    ...    ...
95      1      1  13472
96      1      2  26370
97      1      1  21955
98      3      2  10211
99      1      2  25690

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [36]:
bigcolumn=pd.concat([df1, df2,df3])
bigcolumn

        0
0       2
1       1
2       2
3       1
4       3
..    ...
95  13472
96  26370
97  21955
98  10211
99  25690

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [37]:
# no it's not true because i have 300 row
bigcolumn.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [38]:
bigcolumn.reset_index(inplace=True)
bigcolumn

     index      0
0        0      2
1        1      1
2        2      2
3        3      1
4        4      3
..     ...    ...
295     95  13472
296     96  26370
297     97  21955
298     98  10211
299     99  25690

[300 rows x 2 columns]